#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>

```terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/bcgov/xgr00q-dev-sso-requests/runs/run-491VD8UC7NZc4qKu

Waiting for the plan to start...

Terraform v1.0.1
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...
module.db.random_id.snapshot_identifier[0]: Refreshing state... [id=AMzs6g]
aws_iam_role.iam_for_lambda: Refreshing state... [id=iam_for_lambda]
aws_api_gateway_rest_api.sso_backend: Refreshing state... [id=gcp9dahm4c]
module.db.aws_db_subnet_group.this[0]: Refreshing state... [id=aurora-db-postgres]
aws_iam_role_policy_attachment.this: Refreshing state... [id=iam_for_lambda-20210630175300092700000001]
aws_api_gateway_resource.proxy: Refreshing state... [id=oly2td]
aws_api_gateway_method.proxy_root: Refreshing state... [id=agm-gcp9dahm4c-irntllxe14-ANY]
aws_api_gateway_method.proxy: Refreshing state... [id=agm-gcp9dahm4c-oly2td-ANY]
aws_security_group.rds_sg: Refreshing state... [id=sg-0dd30e1d7b3040e06]
module.db.aws_security_group.this[0]: Refreshing state... [id=sg-064f9794b304dc7dd]
module.db.aws_rds_cluster.this[0]: Refreshing state... [id=aurora-db-postgres]
aws_lambda_function.db: Refreshing state... [id=lambda-db]
module.db.aws_security_group_rule.default_ingress[0]: Refreshing state... [id=sgrule-4119090639]
aws_lambda_function.auth: Refreshing state... [id=handler]
aws_api_gateway_integration.lambda_root: Refreshing state... [id=agi-gcp9dahm4c-irntllxe14-ANY]
aws_lambda_permission.apigw: Refreshing state... [id=AllowAPIGatewayInvoke]
aws_api_gateway_integration.lambda: Refreshing state... [id=agi-gcp9dahm4c-oly2td-ANY]
aws_api_gateway_deployment.this: Refreshing state... [id=nn1sip]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.invoke_github will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "invoke_github"  {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "lambda:InvokeAsync",
              + "lambda:InvokeFunction",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
        }
    }

  # data.aws_lambda_invocation.db will be read during apply
  # (config refers to values not yet known)
 <= data "aws_lambda_invocation" "db"  {
      ~ id            = "lambda-db_$LATEST_5b76b0eef9af8a2300673e0553f609f9" -> (known after apply)
      - qualifier     = "$LATEST" -> null
      ~ result        = jsonencode(
            {
              - body       = {
                  - success = true
                }
              - headers    = {
                  - time = "2021-07-05T22:56:59.778Z"
                }
              - statusCode = 200
            }
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # aws_iam_role_policy.lambda_invoke will be created
  + resource "aws_iam_role_policy" "lambda_invoke" {
      + id     = (known after apply)
      + name   = (known after apply)
      + policy = (known after apply)
      + role   = "iam_for_lambda"
    }

  # aws_lambda_function.auth will be updated in-place
  ~ resource "aws_lambda_function" "auth" {
        id                             = "handler"
      ~ last_modified                  = "2021-07-05T22:56:39.418+0000" -> (known after apply)
      ~ source_code_hash               = "+7AysNn8EPv9RFRrD2NOis5GsaKA/h8hzLYr9QoxLqk=" -> "7Of9Yl+yMMxNmgM89sDSqXXaFEQRhOKtWRW5X4KE7yk="
        tags                           = {
            "managed-by" = "terraform"
        }
        # (23 unchanged attributes hidden)



      ~ vpc_config {
          ~ subnet_ids         = [
              - "subnet-0077fd92d83bfff33",
              + "subnet-048e25be105ae01d3",
              + "subnet-0896ff158c3ecdc53",
              - "subnet-089c577af80110363",
            ]
            # (2 unchanged attributes hidden)
        }
        # (2 unchanged blocks hidden)
    }

  # aws_lambda_function.db will be updated in-place
  ~ resource "aws_lambda_function" "db" {
        id                             = "lambda-db"
      ~ last_modified                  = "2021-07-05T22:56:33.231+0000" -> (known after apply)
      ~ source_code_hash               = "j6a1jA7th7OOeJ2da7pRBL6tixyNf7ll+xwPywVTB0Q=" -> "JMOWS+4kzi7mVSpJ6E2LHche6TkZli62TFHkdB2bkDM="
        tags                           = {
            "managed-by" = "terraform"
        }
        # (23 unchanged attributes hidden)



      ~ vpc_config {
          ~ subnet_ids         = [
              - "subnet-0077fd92d83bfff33",
              + "subnet-048e25be105ae01d3",
              + "subnet-0896ff158c3ecdc53",
              - "subnet-089c577af80110363",
            ]
            # (2 unchanged attributes hidden)
        }
        # (2 unchanged blocks hidden)
    }

  # aws_lambda_function.github will be created
  + resource "aws_lambda_function" "github" {
      + arn                            = (known after apply)
      + filename                       = "lambda-github.zip"
      + function_name                  = "lambda-github"
      + handler                        = "github/src/main.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = "arn:aws:iam::220881534007:role/iam_for_lambda"
      + runtime                        = "nodejs12.x"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = "4Eraltc2y3SLRzQles4HjyOye5f0y4Btl23e01bp5TE="
      + source_code_size               = (known after apply)
      + tags                           = {
          + "managed-by" = "terraform"
        }
      + tags_all                       = {
          + "managed-by" = "terraform"
        }
      + timeout                        = 30
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "GH_ACCESS_TOKEN" = "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"
              + "GH_BRANCH"       = "main"
              + "GH_REPO"         = "sso-terraform-dev"
              + "GH_WORKFLOW_ID"  = "request.yml"
            }
        }

      + tracing_config {
          + mode = (known after apply)
        }

      + vpc_config {
          + security_group_ids = [
              + "sg-0dd30e1d7b3040e06",
            ]
          + subnet_ids         = [
              + "subnet-048e25be105ae01d3",
              + "subnet-0896ff158c3ecdc53",
            ]
          + vpc_id             = (known after apply)
        }
    }

  # module.db.aws_db_subnet_group.this[0] will be updated in-place
  ~ resource "aws_db_subnet_group" "this" {
        id          = "aurora-db-postgres"
        name        = "aurora-db-postgres"
      ~ subnet_ids  = [
          - "subnet-0077fd92d83bfff33",
          + "subnet-048e25be105ae01d3",
          + "subnet-0896ff158c3ecdc53",
          - "subnet-089c577af80110363",
        ]
        tags        = {
            "Name"      = "aurora-aurora-db-postgres"
            "Terraform" = "true"
        }
        # (3 unchanged attributes hidden)
    }

Plan: 2 to add, 3 to change, 0 to destroy.

Changes to Outputs:
  ~ result_entry = {
      - body       = {
          - success = true
        }
      - headers    = {
          - time = "2021-07-05T22:56:59.778Z"
        }
      - statusCode = 200
    } -> (known after apply)

------------------------------------------------------------------------

Cost estimation:

Waiting for cost estimate to complete...

Cost estimation:

Resources: 1 of 2 estimated
           $89.28/mo +$0.0
```

</details>

*Pusher: @jlangy, Action: `pull_request`*